Revit 2024 API
ContinuousRailType.DefaultJoinOption Property
 The default join option between two rails.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public RailTypeDefaultJoinOption DefaultJoinOption { get; set; }
Visual Basic
Public Property DefaultJoinOption As RailTypeDefaultJoinOption
	Get
	Set
Visual C++
public:
property RailTypeDefaultJoinOption DefaultJoinOption {
	RailTypeDefaultJoinOption get ();
	void set (RailTypeDefaultJoinOption value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace